3devo/Arduino-3devo/avr/boards.txt
# Permission is hereby granted, free of charge, to anyone obtaining
# a copy of this document, to do whatever they want with them without
# any restriction, including, but not limited to, copying, modification
# and redistribution.
#
# NO WARRANTY OF ANY KIND IS PROVIDED.

devoboard.name=3devo Devoboard

devoboard.vid.0=0x16D0
devoboard.pid.0=0x0C5B

devoboard.upload.tool=arduino:avrdude
devoboard.upload.protocol=arduino
devoboard.upload.speed=115200
devoboard.upload.maximum_size=261120
devoboard.upload.maximum_data_size=8192

# Compared to Arduino Mega2560 fuses, BODLEVEL is raised from 2.7, and
# JTAGEN and EESAVE are enabled.

# Low power crystal oscillator 8-16Mhz, 16K CK + 65ms
devoboard.bootloader.low_fuses=0xFF
# OCDEN, JTAGEN, SPIEN, EESAVE, BOOTSZ=1024bytes, BOOTRST
devoboard.bootloader.high_fuses=0x16
# BODLEVEL=4.3V
devoboard.bootloader.extended_fuses=0xFC
devoboard.bootloader.unlock_bits=0x3F
devoboard.bootloader.lock_bits=0x0F
devoboard.bootloader.tool=arduino:avrdude
devoboard.bootloader.file=optiboot_atmega2560.hex

devoboard.build.mcu=atmega2560
devoboard.build.f_cpu=16000000L
devoboard.build.core=arduino:arduino
devoboard.build.variant=mega
devoboard.build.board=AVR_DEVOBOARD




interfaceboard.name=3devo Interfaceboard
# No upload tool, bootloader does not support UART
interfaceboard.upload.maximum_size=6144
interfaceboard.upload.maximum_data_size=512

interfaceboard.bootloader.tool=avrdude
interfaceboard.bootloader.unlock_bits=0xFF
interfaceboard.bootloader.lock_bits=0xFF
interfaceboard.bootloader.low_fuses=0xE2
interfaceboard.bootloader.extended_fuses=0xF4
interfaceboard.bootloader.high_fuses=0xD5

# Enable lto
interfaceboard.ltocflags=-flto -fno-fat-lto-objects
interfaceboard.ltoelfflags=-flto -fuse-linker-plugin
interfaceboard.ltocppflags=-flto
interfaceboard.ltoarcmd=gcc-

interfaceboard.build.core=ATTinyCore:tinymodern
interfaceboard.build.board=AVR_INTERFACEBOARD
interfaceboard.build.export_merged_output=false
interfaceboard.build.mcu=attiny841
interfaceboard.build.f_cpu=8000000L
